[{
        "Page": "start",
        "Template": "Question",
        "Header": "Are you over 18 years old?",
        "Hint": "You must be 18 years old or over to apply for probate in Northern Ireland.",
        "Validation": "Answer 'yes' if you are over 18 years old",
        "OnYes": "death-certificate",
        "OnNo": "not-18"
    },
    {
      "Page": "death-certificate",
      "Template": "Question",
      "Header": "Do you have a death certificate?",
      "Hint": "You need the <a class='govuk-link' rel='noreferrer noopener' target='_blank' href='https://www.nidirect.gov.uk/articles/registering-death-district-registrar'>original death certificate (opens in a new window)</a> or an <a class='govuk-link' rel='noreferrer noopener' target='_blank' href='https://www.nidirect.gov.uk/articles/coroners-post-mortems-and-inquests'>interim death certificate (opens in a new window)</a> from the coroner.",
      "Validation": "Answer 'yes' you have a death certificate.",
      "OnYes": "domicile-ni",
      "OnNo": "no-death-certificate"
    },
    {
        "Page": "no-death-certificate",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
        "Hint": "You need to have the original death certificate or an interim death certificate from the coroner to apply for probate"
    },
    {
        "Page": "not-18",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
        "Hint": "You need to be 18 to apply for Probate"
    },
    {
      "Page": "domicile-ni",
      "Template": "Question",
      "Header": "Did the person who died live permanently in Northern Ireland, or intend to return here?",
      "Hint": "You can only apply for probate online if the person who died was domiciled in Northern Ireland at the time of their death.</br></br>You can read more about <a class='govuk-link' rel='noreferrer noopener' target='_blank' href='https://www.gov.uk/inheritance-tax/when-someone-living-outside-the-uk-dies'> domicile (opens in a new window)</a>",
      "Validation": "Answer ‘yes’ if the person who died lived in Northern Ireland or intended to return here",
      "OnYes": "iht",
      "OnNo": "not-ni"
    },
    {
        "Page": "not-ni",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
      "Hint": "You can't use the online service because the person who died didn't live in Northern Ireland or intend to return here.</br></br>You will need to apply by post instead. The form you need to fill in depends on whether the person left a will or not.</br></br>If the person left a will, fill in the probate application form PA1P (opens in a new window)</br></br>If the person did not leave a will, fill in the probate application form PA1A (opens in a new window)"
    },
    {
      "Page": "iht",
      "Template": "Question",
      "Header": "Has an Inheritance Tax (IHT) form been filled in?",
      "Hint": "If the answer is No, You cannot apply for Probate until you complete an IHT form from this <a class='govuk-link' rel='noreferrer noopener' target='_blank' href='https://www.gov.uk/inheritance-tax'>link (opens in new tab)</a>.",
      "Validation": "Answer ‘yes’ if you have completed the Inheritance Tax Forms.",
      "OnYes": "has-will",
      "OnNo": "no-iht"
    },
    {
      "Page": "no-iht",
      "Template": "End",
      "Header": "Sorry, you can't use the online service at this time",
      "Hint": "You need to complete an inheritance tax form this <a class='govuk-link' rel='noreferrer noopener' target='_blank' href='https://www.gov.uk/inheritance-tax'>link (opens in new tab)</a> before applying for probate"
    },
    {
      "Page": "has-will",
      "Template": "Question",
      "Header": "Did the person who died leave a will?",
      "Hint": "",
      "Validation": "Answer ‘yes’ if the person who died left a will",
      "OnYes": "was-married",
      "OnNo": "relationship"
    },
    {
      "Page": "was-married",
      "Template": "Question",
      "Header": "Did the person who died marry or enter into a civil partnership after the Will was signed?",
      "Hint": "",
      "Validation": "Answer ‘yes’ if the person who died married or entered into a civil partnership after the will was signed",
      "OnYes": "married-after-will",
      "OnNo": "original-will"

    },
    {
      "Page": "married-after-will",
      "Template": "End",
      "Header": "Sorry, you can't use the online service at this time",
      "Hint": "The marriage may have invalidated the Will – please seek legal advice on this issue before making your application"
    },
    {
        "Page": "relationship",
        "Template": "Question",
        "Header": "Are you the spouse, civil partner or child of the person who died?",
        "Hint": "You must be the husband, wife, civil partner or a child over 18 to continue with your application online.</br></br>This does not include long-term partners who lived together but did not marry or enter into a civil partnership.</br></br>You may need to provide your certificate of marriage or civil partnership.",
        "Validation": "Answer ‘yes’ if you are the spouse, civil partner or child of the person who died",
        "OnYes": "create-account",
        "OnNo": "not-related"
    },
    {
        "Page": "not-related",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
        "Hint": "You can’t apply for probate online if you’re not the husband, wife, civil partner or child of the person who died.</br></br>You will need to apply by post instead. Fill in the probate application form PA1A (opens in a new window)."
    },
    {
        "Page": "original-will",
        "Template": "Question",
        "Header": "Do you have the original will?",
        "Hint": "You need the original, not a photocopy",
        "Validation": "Answer ‘yes’ if you have the original will",
        "OnYes": "executor",
        "OnNo": "no-will"
    },
    {
        "Page": "executor",
        "Template": "Question",
        "Header": "Are you named as an executor on the will?",
        "Hint": "An executor is responsible for carrying out the instructions in the will.</br></br>This is not the same as a beneficiary who will get money or other property from the person who died. You could be named as both an executor and a beneficiary.",
        "Validation": "Answer ‘yes’ if you are named as an executor on the will",
        "OnYes": "executor-decisions",
        "OnNo": "not-executor"
    },
    {
      "Page": "no-will",
      "Template": "End",
      "Header": "Sorry, you can't use the online service at this time",
      "Hint": "Please contact the Probate Office on 0300 2007 812 for further guidance on the next steps you should take."
    },
    {
        "Page": "not-executor",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
        "Hint": "You can't apply for probate online if you're not named as an executor or if you applying on behalf of someone else</br></br>You will need to apply by post instead. Fill in the probate application form PA1P (opens in a new window)the "
    },
    {
      "Page": "executor-decisions",
      "Template": "Question",
      "Header": "Are all the executors able to make their own decisions?",
      "Hint": "Some people are unable to make their own decisions, for example because of a brain injury or an illness like dementia.</br></br>You can read about <a class='govuk-link' rel='noreferrer noopener' target='_blank' href='https://www.nidirect.gov.uk/contacts/contacts-az/office-care-and-protection'>mental capacity (opens in a new window)</a> on GOV.UK",
      "Validation": "Answer ‘yes’ if all executors are able to make their own decisions",
      "OnYes": "executor-digitals",
      "OnNo": "unable"
    },
    {
      "Page": "executor-digitals",
      "Template": "Question",
      "Header": "Do all executors who are applying have a valid email address and mobile phone number?",
      "Validation": "Answer ‘yes’ if all executors have an e-mail address and mobile phone number",
      "OnYes": "create-account",
      "OnNo": "no-digitals"
    },
    {
        "Page": "no-digitals",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
        "Hint": "You will need to apply via paper forms instead."
    },
    {
        "Page": "unable",
        "Template": "End",
        "Header": "Sorry, you can't use the online service at this time",
        "Hint":  "You can’t use the online service as not all executors are able to make their own decisions.</br></br>Please seek legal advice regarding the next steps you should take."
    },
    {
      "Page": "create-account",
      "Template": "Apply",
      "Header": "Create an account",
      "Hint": "Based on the information you've given, you have everything you need to make your application for probate online.</br></br>You will need an email address to create your account.</br></br>You must use your own email address even if someone helps with your application. That's because Probate Office can't discuss details with anyone but the person making the application."
    },
  {
    "Page": "no-joint-application",
    "Template": "End",
    "Header": "Sorry, you can't use the online service at this time",
    "Hint": "You can’t apply for probate online if you want to make a joint application.</br</br>You will need to apply by post instead. Fill in the probate application form PA1A (opens in a new window)."
  },
  {
    "Page": "Accessibility",
    "Template": "End",
    "Header": "Accessibility statement for Probate Service",
    "Hint": ""

  }
]